old_files/SWMM_CFD/Case/OpenFOAM/waterChannel/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    ( 0 -10   5) // 0
    (20 -10   5) // 1
    ( 0  -3   5) // 2
    (20  -3   5) // 3
    ( 0   3   5) // 4
    (20   3   5) // 5
    ( 0  10   5) // 6
    (20  10   5) // 7

    ( 0 -10   8) // 8
    (20 -10   8) // 9
    ( 0  -4   8) // 10
    (20  -4   8) // 11
    ( 0   4   8) // 12
    (20   4   8) // 13
    ( 0  10   8) // 14
    (20  10   8) // 15
);

blocks
(
    //hex (0 1 3 2  8  9 11 10) (20  5 20) simpleGrading (1 1 1)
    hex (2 3 5 4 10 11 13 12) (20 10 20) simpleGrading (1 1 1)
    //hex (4 5 7 6 12 13 15 14) (20  5 20) simpleGrading (1 1 1)
);

edges
(
);
defaultPatch
{
    name walls;
    type wall;
}
boundary
(
    inlet
    {
        type patch;
        faces
        (
            (2 4 12 10)
        );
    }


    outlet
    {
        type patch;
        faces
        (
            (3 5 13 11)
        );
    }

    atmosphere
    {
        type patch;
        faces
        (
            (10 11 13 12)
        );
    }
);

// ************************************************************************* //
