old_files/SWMM_CFD/Case/OpenFOAM/waterChannel/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          200;
        startFace       68200;
    }
    outlet
    {
        type            patch;
        nFaces          200;
        startFace       68400;
    }
    atmosphere
    {
        type            patch;
        nFaces          1200;
        startFace       68600;
    }
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          6000;
        startFace       69800;
    }
)

// ************************************************************************* //
